Repository: Xwioch/BC.SerialPortManagement
Catalog: 19.0/SPM/Translations/Serial Port Management.*.xlf
Languages: it_it

# Enum 1296493595 - Property 2879900210
source: Parity Type (SPM)
it_it: Parità (SPM)

# Enum 2265433141 - Property 2879900210
source: Flow Control Type (SPM)
it_it: Tipo di handshake (SPM)

# Page 1277660811 - Action 3698873769 - Property 1295455071
source: Close the connection with the selected serial port
it_it: Chiude la connessione con la porta seriale

# Page 1277660811 - Action 3698873769 - Property 2879900210
source: Close Port
it_it: Chiudi porta

# Page 1277660811 - Action 412498751 - Property 1295455071
source: Delete all the lines on the terminal subform
it_it: Elimina tutte le righe contenute nel terminale

# Page 1277660811 - Action 412498751 - Property 2879900210
source: Clear Terminal
it_it: Pulisci terminale

# Page 1277660811 - Action 617737079 - Property 1295455071
source: Open the connection with the selected serial port
it_it: Apre la connessione con la porta seriale

# Page 1277660811 - Action 617737079 - Property 2879900210
source: Open Port
it_it: Apri porta

# Page 1277660811 - Control 1520953681 - Property 2879900210
source: Terminal
it_it: Terminale

# Page 1277660811 - Control 1528967265 - Method 3509536664 - NamedType 1001629221
source: Serial connection established
it_it: Connessione seriale stabilita

# Page 1277660811 - Control 1528967265 - Method 3509536664 - NamedType 1051253129
source: Serial connection closed
it_it: Connessione seriale chiusa

# Page 1277660811 - Control 1528967265 - Method 3509536664 - NamedType 2089806789
source: Connection is closing, this could take a while...
it_it: La connessione si sta chiudendo, potrebbe volerci un po' di tempo...

# Page 1277660811 - Control 1528967265 - Method 3509536664 - NamedType 2182730486
source: There was a problem sending the message to the serial port. Check the communication
it_it: Si è verificato un problema durante l'invio del messaggio alla portale seriale. Verificare la connessione.

# Page 1277660811 - Control 1528967265 - Method 3509536664 - NamedType 2830783094
source: There was an error while trying to open or close the serial port
it_it: Si è verificato un errore nell'apertura/chiusura della porta seriale

# Page 1277660811 - Control 1528967265 - Method 3509536664 - NamedType 3048632393
source: Serial feature not available for the web browser. Check all the features on the settings or check if SSL is enabled
it_it: La funzionalità Web Serial API non è disponibile. Verificare le impostazioni del browser e controllare se il tipo ha una connessione sicura (HTTPS/SSL)

# Page 1277660811 - Control 1588750063 - Property 1295455071
source: Specifies if the message must be sent with \r\n characters
it_it: Specifica se il messaggio deve essere inviato con i caratteri di line feed/carriage return \r\n

# Page 1277660811 - Control 1588750063 - Property 2879900210
source: Send with line feed
it_it: Invia con \r\n

# Page 1277660811 - Control 1620301654 - Property 1295455071
source: Specifies the connection status for the selected serial port
it_it: Specifica il codice della porta seriale

# Page 1277660811 - Control 1620301654 - Property 2879900210
source: Status
it_it: Stato

# Page 1277660811 - Control 1620301654 - Property 62802879
source: ,Connected,Failed,In Progress
it_it: ,Connesso,Fallito,In corso

# Page 1277660811 - Control 1759782632 - Property 1295455071
source: Specifies the stop bits for the serial port
it_it: Specifica i stop bits della porta seriale

# Page 1277660811 - Control 1860025631 - Property 1295455071
source: Specifies the buffer size for the serial port
it_it: Specifica la dimensione del buffer della porta seriale

# Page 1277660811 - Control 2346885236 - Property 2879900210
source: Options
it_it: Opzioni

# Page 1277660811 - Control 2487161833 - Property 1295455071
source: Specifies the message to send on the serial port
it_it: Specifica il messaggio che deve essere inviato alla porta seriale

# Page 1277660811 - Control 2487161833 - Property 2879900210
source: Send
it_it: Invia

# Page 1277660811 - Control 2505414041 - Property 1295455071
source: Specifies the parity type for the serial port
it_it: Specifica il tipo di parità della porta seriale

# Page 1277660811 - Control 2794064752 - Property 1295455071
source: Specifies the data bits for the serial port
it_it: Specifica i data bits della porta seriale

# Page 1277660811 - Control 3461834954 - Property 1295455071
source: Specifies the configuration description of the serial port
it_it: Specifica la descrizione della porta seriale

# Page 1277660811 - Control 3467078241 - Property 1295455071
source: Specifies the exception from the javascript add-in
it_it: Specifica l'eccezione generata dall'add-in in javascript

# Page 1277660811 - Control 3467078241 - Property 2879900210
source: Exception
it_it: Eccezione

# Page 1277660811 - Control 362766376 - Property 1295455071
source: Specifies the code for the serial port configuration
it_it: Spec

# Page 1277660811 - Control 362766376 - Property 2879900210
source: Code
it_it: Codice

# Page 1277660811 - Control 3678034265 - Property 1295455071
source: Specifies the connection status message for the selected serial port
it_it: Specifica il messaggio di stato della porta seriale selezionata

# Page 1277660811 - Control 3678034265 - Property 2879900210
source: Status Message
it_it: Descrizione stato

# Page 1277660811 - Control 4126130292 - Property 2879900210
source: Configuration
it_it: Configurazione

# Page 1277660811 - Control 4263519608 - Property 1295455071
source: Specifies the number the idenfity the port on the list of the request devices. Is not che port name (ex. COM1), is the number on the decives array proposed by the requestPort
it_it: Specifica il numero identificativo della porta seriale. Non corrisponde al nome (es. COM1) ma è il numero della porta nell'elenco di quelle disponibili.

# Page 1277660811 - Control 895105199 - Property 1295455071
source: Specifies the flow control type for the serial port
it_it: Specifica il tipo di handshake della porta seriale

# Page 1277660811 - Control 967282452 - Property 1295455071
source: Specifies the boud rate for the serial port
it_it: Specifica il boud rate della porta seriale

# Page 1277660811 - Property 2879900210
source: Serial Port Connection (SPM)
it_it: Connessione porta seriale (SPM)

# Page 1520953681 - Control 2206507320 - Property 1295455071
source: Specifies the date-time of the creation of the message
it_it: Specifica la data-ora della creazione del messaggio

# Page 1520953681 - Control 3080618677 - Property 1295455071
source: Specifies the content of the message
it_it: Specifica il contenuto del messaggio

# Page 1520953681 - Control 39585143 - Property 1295455071
source: Specifies the direction of the message
it_it: Specifica la direzione del messaggio

# Page 1520953681 - Property 2879900210
source: Serial Port Connectionn Subform (SPM)
it_it: Terminale conn. porta seriale (SPM)

# Page 64001301 - Control 1759782632 - Property 1295455071
source: Specifies the stop bits for the serial port
it_it: Specifica i stop bits della porta seriale

# Page 64001301 - Control 1860025631 - Property 1295455071
source: Specifies the buffer size for the serial port
it_it: Specifica la dimensione del buffer della porta seriale

# Page 64001301 - Control 2505414041 - Property 1295455071
source: Specifies the parity type for the serial port
it_it: Specifica il tipo di parità della porta seriale

# Page 64001301 - Control 2794064752 - Property 1295455071
source: Specifies the data bits for the serial port
it_it: Specifica i data bits della porta seriale

# Page 64001301 - Control 3004954119 - Property 1295455071
source: Specifies the configuration code of the serial port
it_it: Specifica il codice della porta seriale

# Page 64001301 - Control 3461834954 - Property 1295455071
source: Specifies the configuration description of the serial port
it_it: Specifica la descrizione della porta seriale

# Page 64001301 - Control 4263519608 - Property 1295455071
source: Specifies the number the idenfity the port on the list of the request devices. Is not che port name (ex. COM1), is the number on the decives array proposed by the requestPort
it_it: Specifica il numero identificativo della porta seriale. Non corrisponde al nome (es. COM1) ma è il numero della porta nell'elenco di quelle disponibili.

# Page 64001301 - Control 895105199 - Property 1295455071
source: Specifies the flow control type for the serial port
it_it: Specifica il tipo di handshake della porta seriale

# Page 64001301 - Control 967282452 - Property 1295455071
source: Specifies the boud rate for the serial port
it_it: Specifica il boud rate della porta seriale

# Page 64001301 - Property 2879900210
source: Serial Port Configuration (SPM)
it_it: Configurazione porte seriali (SPM)

# Table 1528967265 - Field 1860025631 - Property 2879900210
source: Buffer Size
it_it: Dimensione buffer

# Table 1528967265 - Field 2505414041 - Property 2879900210
source: Parity
it_it: Parità

# Table 1528967265 - Field 3004954119 - Property 2879900210
source: Code
it_it: Codice

# Table 1528967265 - Field 3461834954 - Property 2879900210
source: Description
it_it: Descrizione

# Table 1528967265 - Field 4263519608 - Property 2879900210
source: Identifier No.
it_it: Nr. identificativo

# Table 1528967265 - Field 895105199 - Property 2879900210
source: Flow Control
it_it: Handshake

# Table 1528967265 - Property 2879900210
source: Serial Port
it_it: Porta seriale

# Table 4026949001 - Field 2206507320 - Property 2879900210
source: Date-Time
it_it: Data-ora

# Table 4026949001 - Field 3080618677 - Property 2879900210
source: Message
it_it: Messaggio

# Table 4026949001 - Field 39585143 - Property 2879900210
source: Direction
it_it: Direzione

# Table 4026949001 - Field 39585143 - Property 62802879
source: Inbound,Outbound
it_it: In entrata,In uscita

# Table 4026949001 - Field 883711285 - Property 2879900210
source: Entry No.
it_it: Nr. movimento

# Table 4026949001 - Property 2879900210
source: Serial Port Buffer
it_it: Buffer porta seriale
